#ifndef _POKEMON_PORTAL_HEADER_
#define _POKEMON_PORTAL_HEADER_
#include "nginx_common.h"
#include "player.h"

// Portal 위치와 크기를 사전에 정의해둔 map
static int mapPortal[][3][5] = {
	{ // 집 2층
		{112,32,16,32,1},
		{1,1,1,1,0}
	},
	{ // 집 1층(1)
		{160,32,16,16,0},
		{48,144,16,16,2}
	},
	{ // 마을(1)
		{240,372,16,16,3},
		{256,472,16,16,4},
		{96,344,16,16,6}
	},
	{ // 집1층(2)
		{160,32,16,16,0},
		{48,144,16,16,2}
	},
	{ // 오박사 연구실
		{96,210,16,16,5},
		{0,}
	},
	{ // 마을(2)
		{240,372,16,16,3},
		{256,472,16,16,4},
		{96,344,16,16,6}
	},
	{ // 체육관
		{112,242,16,16,7},
		{0,}
	},
	{ // 마을(3)
		{240,372,16,16,3},
		{256,472,16,16,4},
		{96,344,16,16,6}
	},

};

/// <summary>
/// 플레이어의 현재 위치가 portal인지 확인하는 함수
/// </summary>
/// <param name="_player"></param>
/// <returns>포탈에 대응하는 스테이지 고유 코드 반환</returns>
int isPortal(player _player);
#endif